load-tests/results/shorten-anon.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/anonymous-shorten.js
        output: json (load-tests/results/shorten-anon.json)

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m30s max duration (incl. graceful stop):
              * anonymous_shorten: 20.00 iterations/s for 1m0s (maxVUs: 10-50, gracefulStop: 30s)


running (0m01.0s), 02/10 VUs, 18 complete and 0 interrupted iterations
anonymous_shorten   [   2% ] 02/10 VUs  0m01.0s/1m0s  20.00 iters/s

running (0m02.0s), 02/10 VUs, 38 complete and 0 interrupted iterations
anonymous_shorten   [   3% ] 02/10 VUs  0m02.0s/1m0s  20.00 iters/s

running (0m03.0s), 02/10 VUs, 58 complete and 0 interrupted iterations
anonymous_shorten   [   5% ] 02/10 VUs  0m03.0s/1m0s  20.00 iters/s

running (0m04.0s), 02/10 VUs, 78 complete and 0 interrupted iterations
anonymous_shorten   [   7% ] 02/10 VUs  0m04.0s/1m0s  20.00 iters/s

running (0m05.0s), 02/10 VUs, 98 complete and 0 interrupted iterations
anonymous_shorten   [   8% ] 02/10 VUs  0m05.0s/1m0s  20.00 iters/s

running (0m06.0s), 02/10 VUs, 118 complete and 0 interrupted iterations
anonymous_shorten   [  10% ] 02/10 VUs  0m06.0s/1m0s  20.00 iters/s

running (0m07.0s), 02/10 VUs, 138 complete and 0 interrupted iterations
anonymous_shorten   [  12% ] 02/10 VUs  0m07.0s/1m0s  20.00 iters/s

running (0m08.0s), 02/10 VUs, 158 complete and 0 interrupted iterations
anonymous_shorten   [  13% ] 02/10 VUs  0m08.0s/1m0s  20.00 iters/s

running (0m09.0s), 02/10 VUs, 178 complete and 0 interrupted iterations
anonymous_shorten   [  15% ] 02/10 VUs  0m09.0s/1m0s  20.00 iters/s

running (0m10.0s), 02/10 VUs, 198 complete and 0 interrupted iterations
anonymous_shorten   [  17% ] 02/10 VUs  0m10.0s/1m0s  20.00 iters/s

running (0m11.0s), 02/10 VUs, 218 complete and 0 interrupted iterations
anonymous_shorten   [  18% ] 02/10 VUs  0m11.0s/1m0s  20.00 iters/s

running (0m12.0s), 02/10 VUs, 238 complete and 0 interrupted iterations
anonymous_shorten   [  20% ] 02/10 VUs  0m12.0s/1m0s  20.00 iters/s

running (0m13.0s), 02/10 VUs, 258 complete and 0 interrupted iterations
anonymous_shorten   [  22% ] 02/10 VUs  0m13.0s/1m0s  20.00 iters/s

running (0m14.0s), 02/10 VUs, 278 complete and 0 interrupted iterations
anonymous_shorten   [  23% ] 02/10 VUs  0m14.0s/1m0s  20.00 iters/s

running (0m15.0s), 02/10 VUs, 298 complete and 0 interrupted iterations
anonymous_shorten   [  25% ] 02/10 VUs  0m15.0s/1m0s  20.00 iters/s

running (0m16.0s), 02/10 VUs, 318 complete and 0 interrupted iterations
anonymous_shorten   [  27% ] 02/10 VUs  0m16.0s/1m0s  20.00 iters/s

running (0m17.0s), 02/10 VUs, 338 complete and 0 interrupted iterations
anonymous_shorten   [  28% ] 02/10 VUs  0m17.0s/1m0s  20.00 iters/s

running (0m18.0s), 02/10 VUs, 358 complete and 0 interrupted iterations
anonymous_shorten   [  30% ] 02/10 VUs  0m18.0s/1m0s  20.00 iters/s

running (0m19.0s), 02/10 VUs, 378 complete and 0 interrupted iterations
anonymous_shorten   [  32% ] 02/10 VUs  0m19.0s/1m0s  20.00 iters/s

running (0m20.0s), 02/10 VUs, 398 complete and 0 interrupted iterations
anonymous_shorten   [  33% ] 02/10 VUs  0m20.0s/1m0s  20.00 iters/s

running (0m21.0s), 02/10 VUs, 418 complete and 0 interrupted iterations
anonymous_shorten   [  35% ] 02/10 VUs  0m21.0s/1m0s  20.00 iters/s

running (0m22.0s), 02/10 VUs, 438 complete and 0 interrupted iterations
anonymous_shorten   [  37% ] 02/10 VUs  0m22.0s/1m0s  20.00 iters/s

running (0m23.0s), 02/10 VUs, 458 complete and 0 interrupted iterations
anonymous_shorten   [  38% ] 02/10 VUs  0m23.0s/1m0s  20.00 iters/s

running (0m24.0s), 02/10 VUs, 478 complete and 0 interrupted iterations
anonymous_shorten   [  40% ] 02/10 VUs  0m24.0s/1m0s  20.00 iters/s

running (0m25.0s), 02/10 VUs, 498 complete and 0 interrupted iterations
anonymous_shorten   [  42% ] 02/10 VUs  0m25.0s/1m0s  20.00 iters/s

running (0m26.0s), 02/10 VUs, 518 complete and 0 interrupted iterations
anonymous_shorten   [  43% ] 02/10 VUs  0m26.0s/1m0s  20.00 iters/s

running (0m27.0s), 02/10 VUs, 538 complete and 0 interrupted iterations
anonymous_shorten   [  45% ] 02/10 VUs  0m27.0s/1m0s  20.00 iters/s

running (0m28.0s), 02/10 VUs, 558 complete and 0 interrupted iterations
anonymous_shorten   [  47% ] 02/10 VUs  0m28.0s/1m0s  20.00 iters/s

running (0m29.0s), 02/10 VUs, 578 complete and 0 interrupted iterations
anonymous_shorten   [  48% ] 02/10 VUs  0m29.0s/1m0s  20.00 iters/s

running (0m30.0s), 02/10 VUs, 598 complete and 0 interrupted iterations
anonymous_shorten   [  50% ] 02/10 VUs  0m30.0s/1m0s  20.00 iters/s

running (0m31.0s), 02/10 VUs, 618 complete and 0 interrupted iterations
anonymous_shorten   [  52% ] 02/10 VUs  0m31.0s/1m0s  20.00 iters/s

running (0m32.0s), 02/10 VUs, 638 complete and 0 interrupted iterations
anonymous_shorten   [  53% ] 02/10 VUs  0m32.0s/1m0s  20.00 iters/s

running (0m33.0s), 02/10 VUs, 658 complete and 0 interrupted iterations
anonymous_shorten   [  55% ] 02/10 VUs  0m33.0s/1m0s  20.00 iters/s

running (0m34.0s), 02/10 VUs, 678 complete and 0 interrupted iterations
anonymous_shorten   [  57% ] 02/10 VUs  0m34.0s/1m0s  20.00 iters/s

running (0m35.0s), 02/10 VUs, 698 complete and 0 interrupted iterations
anonymous_shorten   [  58% ] 02/10 VUs  0m35.0s/1m0s  20.00 iters/s

running (0m36.0s), 02/10 VUs, 718 complete and 0 interrupted iterations
anonymous_shorten   [  60% ] 02/10 VUs  0m36.0s/1m0s  20.00 iters/s

running (0m37.0s), 02/10 VUs, 738 complete and 0 interrupted iterations
anonymous_shorten   [  62% ] 02/10 VUs  0m37.0s/1m0s  20.00 iters/s

running (0m38.0s), 02/10 VUs, 758 complete and 0 interrupted iterations
anonymous_shorten   [  63% ] 02/10 VUs  0m38.0s/1m0s  20.00 iters/s

running (0m39.0s), 02/10 VUs, 778 complete and 0 interrupted iterations
anonymous_shorten   [  65% ] 02/10 VUs  0m39.0s/1m0s  20.00 iters/s

running (0m40.0s), 02/10 VUs, 798 complete and 0 interrupted iterations
anonymous_shorten   [  67% ] 02/10 VUs  0m40.0s/1m0s  20.00 iters/s

running (0m41.0s), 02/10 VUs, 818 complete and 0 interrupted iterations
anonymous_shorten   [  68% ] 02/10 VUs  0m41.0s/1m0s  20.00 iters/s

running (0m42.0s), 02/10 VUs, 838 complete and 0 interrupted iterations
anonymous_shorten   [  70% ] 02/10 VUs  0m42.0s/1m0s  20.00 iters/s

running (0m43.0s), 02/10 VUs, 858 complete and 0 interrupted iterations
anonymous_shorten   [  72% ] 02/10 VUs  0m43.0s/1m0s  20.00 iters/s

running (0m44.0s), 02/10 VUs, 878 complete and 0 interrupted iterations
anonymous_shorten   [  73% ] 02/10 VUs  0m44.0s/1m0s  20.00 iters/s

running (0m45.0s), 02/10 VUs, 898 complete and 0 interrupted iterations
anonymous_shorten   [  75% ] 02/10 VUs  0m45.0s/1m0s  20.00 iters/s

running (0m46.0s), 02/10 VUs, 918 complete and 0 interrupted iterations
anonymous_shorten   [  77% ] 02/10 VUs  0m46.0s/1m0s  20.00 iters/s

running (0m47.0s), 02/10 VUs, 938 complete and 0 interrupted iterations
anonymous_shorten   [  78% ] 02/10 VUs  0m47.0s/1m0s  20.00 iters/s

running (0m48.0s), 02/10 VUs, 958 complete and 0 interrupted iterations
anonymous_shorten   [  80% ] 02/10 VUs  0m48.0s/1m0s  20.00 iters/s

running (0m49.0s), 02/10 VUs, 978 complete and 0 interrupted iterations
anonymous_shorten   [  82% ] 02/10 VUs  0m49.0s/1m0s  20.00 iters/s

running (0m50.0s), 02/10 VUs, 998 complete and 0 interrupted iterations
anonymous_shorten   [  83% ] 02/10 VUs  0m50.0s/1m0s  20.00 iters/s

running (0m51.0s), 02/10 VUs, 1018 complete and 0 interrupted iterations
anonymous_shorten   [  85% ] 02/10 VUs  0m51.0s/1m0s  20.00 iters/s

running (0m52.0s), 02/10 VUs, 1038 complete and 0 interrupted iterations
anonymous_shorten   [  87% ] 02/10 VUs  0m52.0s/1m0s  20.00 iters/s

running (0m53.0s), 02/10 VUs, 1058 complete and 0 interrupted iterations
anonymous_shorten   [  88% ] 02/10 VUs  0m53.0s/1m0s  20.00 iters/s

running (0m54.0s), 02/10 VUs, 1078 complete and 0 interrupted iterations
anonymous_shorten   [  90% ] 02/10 VUs  0m54.0s/1m0s  20.00 iters/s

running (0m55.0s), 02/10 VUs, 1098 complete and 0 interrupted iterations
anonymous_shorten   [  92% ] 02/10 VUs  0m55.0s/1m0s  20.00 iters/s

running (0m56.0s), 02/10 VUs, 1118 complete and 0 interrupted iterations
anonymous_shorten   [  93% ] 02/10 VUs  0m56.0s/1m0s  20.00 iters/s

running (0m57.0s), 02/10 VUs, 1138 complete and 0 interrupted iterations
anonymous_shorten   [  95% ] 02/10 VUs  0m57.0s/1m0s  20.00 iters/s

running (0m58.0s), 02/10 VUs, 1158 complete and 0 interrupted iterations
anonymous_shorten   [  97% ] 02/10 VUs  0m58.0s/1m0s  20.00 iters/s

running (0m59.0s), 02/10 VUs, 1178 complete and 0 interrupted iterations
anonymous_shorten   [  98% ] 02/10 VUs  0m59.0s/1m0s  20.00 iters/s

running (1m00.0s), 02/10 VUs, 1198 complete and 0 interrupted iterations
anonymous_shorten   [ 100% ] 02/10 VUs  1m00.0s/1m0s  20.00 iters/s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<250' p(95)=11.46ms
    ✓ 'p(99)<500' p(99)=12.84ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    urls_created
    ✓ 'count>0' count=1200


  █ TOTAL RESULTS 

    checks_total.......: 2400    39.960667/s
    checks_succeeded...: 100.00% 2400 out of 2400
    checks_failed......: 0.00%   0 out of 2400

    ✓ created short URL
    ✓ shortCode returned

    CUSTOM
    urls_created...................: 1200   19.980333/s

    HTTP
    http_req_duration..............: avg=8.21ms   min=3.27ms  med=8.16ms   max=26.34ms p(90)=10.56ms  p(95)=11.46ms 
      { expected_response:true }...: avg=8.21ms   min=3.27ms  med=8.16ms   max=26.34ms p(90)=10.56ms  p(95)=11.46ms 
    http_req_failed................: 0.00%  0 out of 1200
    http_reqs......................: 1200   19.980333/s

    EXECUTION
    iteration_duration.............: avg=109.03ms min=103.9ms med=109.03ms max=127.7ms p(90)=111.45ms p(95)=112.38ms
    iterations.....................: 1200   19.980333/s
    vus............................: 2      min=2         max=2 
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 843 kB 14 kB/s
    data_sent......................: 336 kB 5.6 kB/s



running (1m00.1s), 00/10 VUs, 1200 complete and 0 interrupted iterations
anonymous_shorten ✓ [ 100% ] 00/10 VUs  1m0s  20.00 iters/s